

//  0x90a60170: [Fixed] Mic at Int N/A          Node 0x12   内置麦克风

//  0x01211010: [Jack] HP Out at Ext Rear       Node 0x14   耳机

//  0x01011020: [Jack] Line Out at Ext Rear     Node 0x17   线路输出

//  0x01a11060: [Jack] Mic at Ext Rear          Node 0x18   外置麦克风／耳机输入

//  0x90170130: [Fixed] Speaker at Int N/A      Node 0x19   内置喇叭

//  0x0181106f: [Jack] Line In at Ext Rear      Node 0x1a   线路输入

//  0x90170140: [Fixed] Speaker at Int N/A      Node 0x1b   内置喇叭

//  0x01451150: [Jack] SPDIF Out at Ext Rear    Node 0x1e   SPDIF输出
/*===========================================================================*/

//Speaker at Int N/A
/*=============================双喇叭=========================================*/
//25 -> 38 -> 37     -------------  19 - 26 - 25

/*=============================低音炮=========================================*/
//27 -> 38 -> 37     -------------  1b - 26 - 25

//SPDIF Out at Ext Rear
//30 -> 06           -------------  1e - 06

//HP Out at Ext Rear
//20 -> 12 -> 02     -------------  14 - 0c - 02

//Line Out at Ext Rear
//23 -> 15 -> 05     -------------  17 - 0f - 05

//Mic at Int N/A
//09 -> 34 -> 18     -------------  09 - 22 - 12

//Mic at Ext Rear
//09 -> 34 -> 24     -------------  09 - 22 - 18

//Line In at Ext Rear
//08 -> 35 -> 26     -------------  08 - 23 - 1a

/*=============================以下不用管=========================================*/
//Line In at Ext Rear
//09 - 34 - 26/08 - 35 - 26     -------------  09 - 22 - 1a/08 - 23 - 1a

//Mic at Ext Rear
//09 - 34 - 24/08 - 35 - 24     -------------  09 - 22 - 18/08 - 23 - 18

/*===========================================================================*/
/*
 0 = Line Out
 1 = Speaker
 2 = HP Out
 3 = CD
 4 = SPDIF Out
 5 = Digital Other Out
 6 = Modem Line Side
 7 = Modem Handset Side
 8 = Line In
 9 = AUX
 A = Mic In
 B = Telephone
 C = SPDIF In
 D = Digital Other In
 E = Reserved
 F = Other
 */

//  ID:283904146
//  LayoutID5
//  01171CF0 01171D00 01171E00 01171F40 01271C10 01271D01 01271EA0 01271F90 01471C50 01471D10 01471E21 01471F01 01571CF0 01571D00 01571E00 01571F40 01671CF0 01671D00 01671E00 01671F40 01771C60 01771D10 01771E01 01771F01 01871C10 01871D10 01871EA1 01871F01 01971C40 01971D01 01971E10 01971F90 01A71C20 01A71D10 01A71E81 01A71F01 01B71C42 01B71D01 01B71E10 01B71F90 01C71CF0 01C71D00 01C71E00 01C71F40 01D71CF0 01D71D00 01D71E00 01D71F40 01E71C70 01E71D10 01E71E45 01E71F01 01F71CF0 01F71D00 01F71E00 01F71F40 01470C02
